Xml-integration-demo/HotelRQ/20210619223833733AvailableHotelRooms.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:hot="http://TekTravel/HotelBookingApi" xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><env:Header xmlns:wsa="http://www.w3.org/2005/08/addressing"><hot:Credentials Password="Sra@12896022" UserName="WESARA"/><wsa:Action>http://TekTravel/HotelBookingApi/AvailableHotelRooms</wsa:Action><wsa:To>https://api.tboholidays.com/HotelApi_V7/HotelService.svc</wsa:To></env:Header><env:Body><HotelRoomAvailabilityRequest xmlns="http://TekTravel/HotelBookingApi"><SessionId>41a8c32d-a6a9-4113-a54b-b5912a00fe30</SessionId><ResultIndex>8</ResultIndex><HotelCode>1408388</HotelCode><ResponseTime>17</ResponseTime><IsCancellationPolicyRequired>false</IsCancellationPolicyRequired></HotelRoomAvailabilityRequest></env:Body></env:Envelope>